/****************************************************************************************
 * 文 件 名	: yv00bsponc_netIO.h
 * 项目名称	: YVGA1207001A
 * 模 块 名	: 单向网络通信库
 * 功   能	: 网络IO
 * 操作系统	: LINUX
 * 修改记录	: 无
 * 版   本	: Rev 0.1.0
 *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
 * 设    计	: zhengsw      '2016-11-03
 * 编    码	: zhengsw      '2016-11-03
 * 修    改	: 
 ****************************************************************************************
 *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
 * 公司介绍及版权说明
 *
 *           (C)Copyright 2012 YView    Corporation All Rights Reserved.
 *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
 ***************************************************************************************/


int bsponc_sendPacket(ST_OncSend *pOnc, ST_OncPacket *packet);

int bsponc_recvMsg(int fd, struct sockaddr_in *pAddr, ST_OncProtocol *pProtoHdr, char *pByBuff, int lBuffLen);
